scripts/jmeter.log
2025-11-03 12:58:51,494 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-11-03 12:58:51,511 INFO o.a.j.JMeter: Loading user properties from: /opt/homebrew/Cellar/jmeter/5.6.3/libexec/bin/user.properties
2025-11-03 12:58:51,512 INFO o.a.j.JMeter: Loading system properties from: /opt/homebrew/Cellar/jmeter/5.6.3/libexec/bin/system.properties
2025-11-03 12:58:51,515 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-11-03 12:58:51,515 INFO o.a.j.JMeter: Version 5.6.3
2025-11-03 12:58:51,515 INFO o.a.j.JMeter: java.version=21.0.8
2025-11-03 12:58:51,515 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2025-11-03 12:58:51,515 INFO o.a.j.JMeter: os.name=Mac OS X
2025-11-03 12:58:51,515 INFO o.a.j.JMeter: os.arch=aarch64
2025-11-03 12:58:51,515 INFO o.a.j.JMeter: os.version=15.6.1
2025-11-03 12:58:51,515 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-11-03 12:58:51,515 INFO o.a.j.JMeter: java.awt.headless=true
2025-11-03 12:58:51,515 INFO o.a.j.JMeter: Max memory     =1073741824
2025-11-03 12:58:51,515 INFO o.a.j.JMeter: Available Processors =11
2025-11-03 12:58:51,520 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-11-03 12:58:51,520 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-11-03 12:58:51,520 INFO o.a.j.JMeter: JMeterHome=/opt/homebrew/Cellar/jmeter/5.6.3/libexec
2025-11-03 12:58:51,520 INFO o.a.j.JMeter: user.dir  =/Users/trandinhquangminh/Codespace/ptuddn-t3/scripts
2025-11-03 12:58:51,520 INFO o.a.j.JMeter: PWD       =/Users/trandinhquangminh/Codespace/ptuddn-t3/scripts
2025-11-03 12:58:51,522 INFO o.a.j.JMeter: IP: 127.0.0.1 Name: Trans-Mac.local FullName: localhost
2025-11-03 12:58:51,530 INFO o.a.j.s.FileServer: Default base='/Users/trandinhquangminh/Codespace/ptuddn-t3/scripts'
2025-11-03 12:58:51,530 INFO o.a.j.s.FileServer: Set new base='/Users/trandinhquangminh/Codespace/ptuddn-t3/scripts'
2025-11-03 12:58:51,625 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-11-03 12:58:51,646 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-11-03 12:58:51,648 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-11-03 12:58:51,649 INFO o.a.j.s.SaveService: Loading file: load-test.jmx
2025-11-03 12:58:51,691 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-11-03 12:58:51,691 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-11-03 12:58:51,691 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-11-03 12:58:51,691 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-11-03 12:58:51,691 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-11-03 12:58:51,691 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-11-03 12:58:51,704 INFO o.a.j.JMeter: Creating summariser <summary>
2025-11-03 12:58:51,710 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-11-03 12:58:51,711 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-11-03 12:58:51,711 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-11-03 12:58:51,713 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-11-03 12:58:51,713 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-11-03 12:58:51,740 INFO o.a.j.r.ClassFinder: Will scan jar /opt/homebrew/Cellar/jmeter/5.6.3/libexec/lib/ext/jmeter-plugins-manager-1.9.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-11-03 12:58:51,795 INFO o.a.j.JMeter: Running test (1762149531795)
2025-11-03 12:58:51,803 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Load Test
2025-11-03 12:58:51,803 INFO o.a.j.e.StandardJMeterEngine: Starting 50 threads for group Load Test.
2025-11-03 12:58:51,803 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-11-03 12:58:51,803 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=50 ramp-up=10 delayedStart=false
2025-11-03 12:58:51,805 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-1
2025-11-03 12:58:51,810 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-11-03 12:58:51,810 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-11-03 12:58:52,007 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-2
2025-11-03 12:58:52,063 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = Trans-Mac.local
2025-11-03 12:58:52,066 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-11-03 12:58:52,066 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-11-03 12:58:52,067 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-11-03 12:58:52,067 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-11-03 12:58:52,067 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-11-03 12:58:52,206 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-3
2025-11-03 12:58:52,407 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-4
2025-11-03 12:58:52,609 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-5
2025-11-03 12:58:52,805 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-6
2025-11-03 12:58:53,008 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-7
2025-11-03 12:58:53,206 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-8
2025-11-03 12:58:53,409 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-9
2025-11-03 12:58:53,606 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-10
2025-11-03 12:58:53,807 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-11
2025-11-03 12:58:54,004 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-12
2025-11-03 12:58:54,206 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-13
2025-11-03 12:58:54,406 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-14
2025-11-03 12:58:54,606 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-15
2025-11-03 12:58:54,807 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-16
2025-11-03 12:58:55,006 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-17
2025-11-03 12:58:55,207 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-18
2025-11-03 12:58:55,406 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-19
2025-11-03 12:58:55,606 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-20
2025-11-03 12:58:55,805 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-21
2025-11-03 12:58:56,007 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-22
2025-11-03 12:58:56,203 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-23
2025-11-03 12:58:56,408 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-24
2025-11-03 12:58:56,607 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-25
2025-11-03 12:58:56,805 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-26
2025-11-03 12:58:57,007 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-27
2025-11-03 12:58:57,206 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-28
2025-11-03 12:58:57,408 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-29
2025-11-03 12:58:57,606 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-30
2025-11-03 12:58:57,808 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-31
2025-11-03 12:58:58,006 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-32
2025-11-03 12:58:58,204 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-33
2025-11-03 12:58:58,406 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-34
2025-11-03 12:58:58,607 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-35
2025-11-03 12:58:58,805 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-36
2025-11-03 12:58:59,005 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-37
2025-11-03 12:58:59,205 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-38
2025-11-03 12:58:59,407 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-39
2025-11-03 12:58:59,604 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-40
2025-11-03 12:58:59,808 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-41
2025-11-03 12:59:00,005 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-42
2025-11-03 12:59:00,021 INFO o.a.j.r.Summariser: summary +    517 in 00:00:08 =   62.9/s Avg:   121 Min:     1 Max:   814 Err:     0 (0.00%) Active: 42 Started: 42 Finished: 0
2025-11-03 12:59:00,205 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-43
2025-11-03 12:59:00,408 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-44
2025-11-03 12:59:00,608 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-45
2025-11-03 12:59:00,807 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-46
2025-11-03 12:59:01,008 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-47
2025-11-03 12:59:01,204 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-48
2025-11-03 12:59:01,406 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-49
2025-11-03 12:59:01,605 INFO o.a.j.t.JMeterThread: Thread started: Load Test 1-50
2025-11-03 12:59:05,971 INFO o.a.j.r.ResultCollector: Shutdown hook started
2025-11-03 12:59:05,979 INFO o.a.j.r.ResultCollector: Shutdown hook ended